# RoutingPreferenceManager Properties

---
The RoutingPreferenceManager type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OwnerId|  The Id of the MEPCurveType that owns the RoutingPreferenceManager
| PreferredJunctionType|  The preferred junction type.
Top
#### Reference
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace